training_data: 0 to 999
validation_data: 1000 1999
epochs: 10
steps_per_epoch: 256
validation_steps: 256

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, None, 16)          1059008   
_________________________________________________________________
global_average_pooling1d (Gl (None, 16)                0         
_________________________________________________________________
dense (Dense)                (None, 8)                 136       
_________________________________________________________________
dense_1 (Dense)              (None, 20)                180       
=================================================================