training_data: 0 to 9999
validation_data: 10000 19999
epochs: 20
steps_per_epoch: 100
validation_steps: 100

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, None, 16)          1059008   
_________________________________________________________________
global_average_pooling1d (Gl (None, 16)                0         
_________________________________________________________________
dense (Dense)                (None, 16)                272       
_________________________________________________________________
dense_1 (Dense)              (None, 20)                340       
=================================================================
